Revit 2024 API
BentFabricBendDirection Enumeration
 Direction in which FabricSheet is bent.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Since: 2016
Syntax
C#
public enum BentFabricBendDirection
Visual Basic
Public Enumeration BentFabricBendDirection
Visual C++
public enum class BentFabricBendDirection
Members
Member name | Description
Major |  FabricSheet is bent along major direction axis.
Minor |  FabricSheet is bent along minor direction axis.
See Also
Autodesk.Revit.DB.Structure Namespace